In [ ]:
import numpy as np 
import pandas as pd 
from sklearn import preprocessing
import matplotlib.pyplot as plt 
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
train = pd.read_csv('/content/drive/MyDrive/train.csv')
test = pd.read_csv('/content/drive/MyDrive/test.csv')

train.head()    #plcass(ticket class), SibSp(# of siblings / spouses aboard the Titanic), Parch(# of parents / children aboard the Titanic)
                #Embarked(Port of Embarkation, 	C = Cherbourg, Q = Queenstown, S = Southampton)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

# train data

In [ ]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
len(train)

891

In [ ]:
train['Age'].mean(skipna = True)

29.69911764705882

In [ ]:
train['Age'].median(skipna = True)

28.0

In [ ]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
train_data = train.copy()
train_data["Age"].fillna(train["Age"].median(skipna=True), inplace=True)
train_data["Embarked"].fillna(train['Embarked'].value_counts().idxmax(), inplace=True)
train_data.drop('Cabin', axis=1, inplace=True)

train_data

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

In [ ]:
train_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
train_data['TravelAlone']=np.where((train_data["SibSp"]+train_data["Parch"])>0, 0, 1)
train_data.drop('SibSp', axis=1, inplace=True)
train_data.drop('Parch', axis=1, inplace=True)

In [ ]:
final_train =pd.get_dummies(train_data, columns=["Pclass","Embarked","Sex"])
final_train.drop('Sex_female', axis=1, inplace=True)
final_train.drop('PassengerId', axis=1, inplace=True)
final_train.drop('Name', axis=1, inplace=True)
final_train.drop('Ticket', axis=1, inplace=True)

final_train

     Survived   Age     Fare  ...  Embarked_Q  Embarked_S  Sex_male
0           0  22.0   7.2500  ...           0           1         1
1           1  38.0  71.2833  ...           0           0         0
2           1  26.0   7.9250  ...           0           1         0
3           1  35.0  53.1000  ...           0           1         0
4           0  35.0   8.0500  ...           0           1         1
..        ...   ...      ...  ...         ...         ...       ...
886         0  27.0  13.0000  ...           0           1         1
887         1  19.0  30.0000  ...           0           1         0
888         0  28.0  23.4500  ...           0           1         0
889         1  26.0  30.0000  ...           0           0         1
890         0  32.0   7.7500  ...           1           0         1

[891 rows x 11 columns]

# test data

In [ ]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
test_data = test.copy()
test_data["Age"].fillna(train["Age"].median(skipna=True), inplace=True)
test_data["Fare"].fillna(train["Fare"].median(skipna=True), inplace=True)
test_data.drop('Cabin', axis=1, inplace=True)

test_data['TravelAlone']=np.where((test_data["SibSp"]+test_data["Parch"])>0, 0, 1)

test_data.drop('SibSp', axis=1, inplace=True)
test_data.drop('Parch', axis=1, inplace=True)

final_test = pd.get_dummies(test_data, columns=["Pclass","Embarked","Sex"])
final_test.drop('Sex_female', axis=1, inplace=True)
final_test.drop('PassengerId', axis=1, inplace=True)
final_test.drop('Name', axis=1, inplace=True)
final_test.drop('Ticket', axis=1, inplace=True)

final_test.head()

    Age     Fare  TravelAlone  ...  Embarked_Q  Embarked_S  Sex_male
0  34.5   7.8292            1  ...           1           0         1
1  47.0   7.0000            0  ...           0           1         0
2  62.0   9.6875            1  ...           1           0         1
3  27.0   8.6625            1  ...           0           1         1
4  22.0  12.2875            0  ...           0           1         0

[5 rows x 10 columns]

# Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

X = final_train.drop('Survived',axis = 1)
y = final_train['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=123)

model = LogisticRegression()   # https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html?highlight=logisticregression#sklearn.linear_model.LogisticRegression
model.fit(X_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
y_test_pred = model.predict(final_test)

In [ ]:
answer = pd.read_csv('/content/drive/MyDrive/answer.csv')
answer = answer['Survived']
answer

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [ ]:
from sklearn.metrics import accuracy_score   # 정밀도를 측정

print(accuracy_score(answer,y_test_pred))

0.9497607655502392